Laur59/uKOS-X-IWYU/Third_Parties/esp32/Construction/Examples/ble_to_uart/sdkconfig.defaults
# Target: ESP32
CONFIG_IDF_TARGET="esp32"

# Bluetooth / NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y

CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517

# Helpful logs
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
